# -*- coding: utf-8 -*-
from docx import Document

text = """Принтер Samsung ML-3710D|0414100245|555222|ГА Кезлтнг А.П.|ФЭО Голубева И.В.
Принтер Samsung ML-3710D|0414100245|555222|ГА Кезлтнг А.П.|АУП Яковлева М.Ю.
Принтер Samsung ML-3710D|0414100245|555666|ГА Кезлтнг А.П.|ОНИПП Тропачева А.Г.
Сканер Panasonic KV1234|0414100245|555666|ГА Кезлтнг А.П.|ОНИПП Тропачева А.Г.
Сканер Panasonic KV1234|0414100245|555666|ГА Кезлтнг А.П.|ОНИПП Тропачева А.Г.
Заполню позже|0414100245|555666|АХО Любимская С.А.|ОНИПП Тропачева А.Г.
Заполню позже|0414100245|555666|АХО Любимская С.А.|ОНИПП Тропачева А.Г."""

x = 0
for line in text:
    mylist = []
    x =+ 1
    mylist = line.split('|')
    print(mylist)


#document = Document()

str=("Тест", "utf-8")
#p = document.add_paragraph(str)


#document.save('test.docx')